Tekla.Structures.Drawing.Line
The Line class defines a line that is a two-point line with an optional bulge (curve).
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
Tekla.Structures.Drawing.Line MyLine;
DrawingObjectEnumerator myviews = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(myviews.MoveNext())
{
MyLine = new Tekla.Structures.Drawing.Line(myviews.Current as ViewBase,
new Point(10, 10), new Point(200, 200), 0.5);
MyLine.Insert();
MyLine.Bulge = 0.0;
MyLine.Modify();
}
}
}
}

Tekla.Structures.Drawing.Line.StartPoint
The start point of the line.

Tekla.Structures.Drawing.Line.EndPoint
The end point of the line.

Tekla.Structures.Drawing.Line.Bulge
The bulge (curve) to use for the line (a bulge is the ratio between the height and width of an object).

Tekla.Structures.Drawing.Line.Attributes
The attributes for the line.

Tekla.Structures.Drawing.Line.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Line.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,Tekla.Structures.Drawing.Line.LineAttributes)
Creates a new line instance with two points and a bulge using the given attributes.
view: The view to be used.
startPoint: The start point to be used.
endPoint: The end point to be used.
bulge: The bulge to be used.
attributes: The line attributes to be used.

Tekla.Structures.Drawing.Line.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.Line.LineAttributes)
Creates a new line instance with two points and no bulge (straight line) using the given attributes.
view: The view to be used.
startPoint: The start point to be used.
endPoint: The end point to be used.
inAttributes: The line attributes to be used.

Tekla.Structures.Drawing.Line.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double)
Creates a new line instance with two points and a bulge using standard attributes.
view: The view to be used.
startPoint: The start point to be used.
endPoint: The end point to be used.
bulge: The bulge to be used.

Tekla.Structures.Drawing.Line.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new line instance with two points and no bulge (straight line) using standard attributes.
view: The view to be used.
startPoint: The start point to be used.
endPoint: The end point to be used.

Tekla.Structures.Drawing.Line.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Line.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Line.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.Line.Select
Calls the system to select and retrieve the object.
Returns: True on success.